DefianceDigital/DDC3_Arduino/hardware/DDC3_beta/esp32/boards.txt
menu.UploadSpeed=Upload Speed
menu.CDCOnBoot=USB CDC On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level

##############################################################

pygmy.name=PYGMY
pygmy.vid.0=0x303a
pygmy.pid.0=0x1001

pygmy.bootloader.tool=esptool_py
pygmy.bootloader.tool.default=esptool_py

pygmy.upload.tool=esptool_py
pygmy.upload.tool.default=esptool_py
pygmy.upload.tool.network=esp_ota

pygmy.upload.maximum_size=4128768
pygmy.upload.maximum_data_size=327680
pygmy.upload.flags=
pygmy.upload.extra_flags=
pygmy.upload.use_1200bps_touch=false
pygmy.upload.wait_for_upload_port=false

pygmy.serial.disableDTR=false
pygmy.serial.disableRTS=false

pygmy.build.tarch=riscv32
pygmy.build.target=esp
pygmy.build.mcu=esp32c3
pygmy.build.core=esp32
pygmy.build.variant=pygmy
pygmy.build.board=ESP32C3_DEV
pygmy.build.bootloader_addr=0x0

pygmy.build.cdc_on_boot=1
pygmy.build.f_cpu=160000000L
pygmy.build.flash_size=4MB
pygmy.build.flash_freq=80m
pygmy.build.flash_mode=qio
pygmy.build.boot=qio
pygmy.build.partitions=default
pygmy.build.defines=

pygmy.menu.PartitionScheme.default=PYGMY (3MB APP/0.9MB SPIFFS)
pygmy.menu.PartitionScheme.default.build.partitions=pygmy
pygmy.menu.PartitionScheme.riotlite=rIOT-LITE (3.9MB APP)
pygmy.menu.PartitionScheme.riotlite.build.partitions=riot_lite
pygmy.menu.PartitionScheme.defaultspiffs=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
pygmy.menu.PartitionScheme.defaultspiffs.build.partitions=default
pygmy.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
pygmy.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
pygmy.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
pygmy.menu.PartitionScheme.minimal.build.partitions=minimal
pygmy.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
pygmy.menu.PartitionScheme.no_ota.build.partitions=no_ota
pygmy.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
pygmy.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
pygmy.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
pygmy.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
pygmy.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
pygmy.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
pygmy.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
pygmy.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
pygmy.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
pygmy.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
pygmy.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
pygmy.menu.PartitionScheme.huge_app.build.partitions=huge_app
pygmy.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
pygmy.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
pygmy.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
pygmy.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
pygmy.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
pygmy.menu.PartitionScheme.rainmaker=RainMaker
pygmy.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
pygmy.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

pygmy.menu.CPUFreq.160=160MHz (WiFi)
pygmy.menu.CPUFreq.160.build.f_cpu=160000000L
pygmy.menu.CPUFreq.80=80MHz (WiFi)
pygmy.menu.CPUFreq.80.build.f_cpu=80000000L
pygmy.menu.CPUFreq.40=40MHz
pygmy.menu.CPUFreq.40.build.f_cpu=40000000L
pygmy.menu.CPUFreq.20=20MHz
pygmy.menu.CPUFreq.20.build.f_cpu=20000000L
pygmy.menu.CPUFreq.10=10MHz
pygmy.menu.CPUFreq.10.build.f_cpu=10000000L

pygmy.menu.FlashMode.qio=QIO
pygmy.menu.FlashMode.qio.build.flash_mode=dio
pygmy.menu.FlashMode.qio.build.boot=qio
pygmy.menu.FlashMode.dio=DIO
pygmy.menu.FlashMode.dio.build.flash_mode=dio
pygmy.menu.FlashMode.dio.build.boot=dio
pygmy.menu.FlashMode.qout=QOUT
pygmy.menu.FlashMode.qout.build.flash_mode=dout
pygmy.menu.FlashMode.qout.build.boot=qout
pygmy.menu.FlashMode.dout=DOUT
pygmy.menu.FlashMode.dout.build.flash_mode=dout
pygmy.menu.FlashMode.dout.build.boot=dout

pygmy.menu.FlashFreq.80=80MHz
pygmy.menu.FlashFreq.80.build.flash_freq=80m
pygmy.menu.FlashFreq.40=40MHz
pygmy.menu.FlashFreq.40.build.flash_freq=40m

pygmy.menu.FlashSize.4M=4MB (32Mb)
pygmy.menu.FlashSize.4M.build.flash_size=4MB
pygmy.menu.FlashSize.8M=8MB (64Mb)
pygmy.menu.FlashSize.8M.build.flash_size=8MB
pygmy.menu.FlashSize.8M.build.partitions=default_8MB
pygmy.menu.FlashSize.2M=2MB (16Mb)
pygmy.menu.FlashSize.2M.build.flash_size=2MB
pygmy.menu.FlashSize.2M.build.partitions=minimal
pygmy.menu.FlashSize.16M=16MB (128Mb)
pygmy.menu.FlashSize.16M.build.flash_size=16MB

pygmy.menu.UploadSpeed.921600=921600
pygmy.menu.UploadSpeed.921600.upload.speed=921600
pygmy.menu.UploadSpeed.115200=115200
pygmy.menu.UploadSpeed.115200.upload.speed=115200
pygmy.menu.UploadSpeed.256000.windows=256000
pygmy.menu.UploadSpeed.256000.upload.speed=256000
pygmy.menu.UploadSpeed.230400.windows.upload.speed=256000
pygmy.menu.UploadSpeed.230400=230400
pygmy.menu.UploadSpeed.230400.upload.speed=230400
pygmy.menu.UploadSpeed.460800.linux=460800
pygmy.menu.UploadSpeed.460800.macosx=460800
pygmy.menu.UploadSpeed.460800.upload.speed=460800
pygmy.menu.UploadSpeed.512000.windows=512000
pygmy.menu.UploadSpeed.512000.upload.speed=512000

pygmy.menu.DebugLevel.none=None
pygmy.menu.DebugLevel.none.build.code_debug=0
pygmy.menu.DebugLevel.error=Error
pygmy.menu.DebugLevel.error.build.code_debug=1
pygmy.menu.DebugLevel.warn=Warn
pygmy.menu.DebugLevel.warn.build.code_debug=2
pygmy.menu.DebugLevel.info=Info
pygmy.menu.DebugLevel.info.build.code_debug=3
pygmy.menu.DebugLevel.debug=Debug
pygmy.menu.DebugLevel.debug.build.code_debug=4
pygmy.menu.DebugLevel.verbose=Verbose
pygmy.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

riotlite.name=rIOT-LITE
riotlite.vid.0=0x303a
riotlite.pid.0=0x1001

riotlite.bootloader.tool=esptool_py
riotlite.bootloader.tool.default=esptool_py

riotlite.upload.tool=esptool_py
riotlite.upload.tool.default=esptool_py
riotlite.upload.tool.network=esp_ota

riotlite.upload.maximum_size=4128768
riotlite.upload.maximum_data_size=327680
riotlite.upload.flags=
riotlite.upload.extra_flags=
riotlite.upload.use_1200bps_touch=false
riotlite.upload.wait_for_upload_port=false

riotlite.serial.disableDTR=false
riotlite.serial.disableRTS=false

riotlite.build.tarch=riscv32
riotlite.build.target=esp
riotlite.build.mcu=esp32c3
riotlite.build.core=esp32
riotlite.build.variant=riotlite
riotlite.build.board=ESP32C3_DEV
riotlite.build.bootloader_addr=0x0

riotlite.build.cdc_on_boot=1
riotlite.build.f_cpu=160000000L
riotlite.build.flash_size=4MB
riotlite.build.flash_freq=80m
riotlite.build.flash_mode=qio
riotlite.build.boot=qio
riotlite.build.partitions=riot_lite
riotlite.build.defines=

riotlite.menu.CPUFreq.160=160MHz (WiFi)
riotlite.menu.CPUFreq.160.build.f_cpu=160000000L
riotlite.menu.CPUFreq.80=80MHz (WiFi)
riotlite.menu.CPUFreq.80.build.f_cpu=80000000L
riotlite.menu.CPUFreq.40=40MHz
riotlite.menu.CPUFreq.40.build.f_cpu=40000000L
riotlite.menu.CPUFreq.20=20MHz
riotlite.menu.CPUFreq.20.build.f_cpu=20000000L
riotlite.menu.CPUFreq.10=10MHz
riotlite.menu.CPUFreq.10.build.f_cpu=10000000L

riotlite.menu.FlashMode.qio=QIO
riotlite.menu.FlashMode.qio.build.flash_mode=dio
riotlite.menu.FlashMode.qio.build.boot=qio
riotlite.menu.FlashMode.dio=DIO
riotlite.menu.FlashMode.dio.build.flash_mode=dio
riotlite.menu.FlashMode.dio.build.boot=dio
riotlite.menu.FlashMode.qout=QOUT
riotlite.menu.FlashMode.qout.build.flash_mode=dout
riotlite.menu.FlashMode.qout.build.boot=qout
riotlite.menu.FlashMode.dout=DOUT
riotlite.menu.FlashMode.dout.build.flash_mode=dout
riotlite.menu.FlashMode.dout.build.boot=dout

riotlite.menu.FlashFreq.80=80MHz
riotlite.menu.FlashFreq.80.build.flash_freq=80m
riotlite.menu.FlashFreq.40=40MHz
riotlite.menu.FlashFreq.40.build.flash_freq=40m

riotlite.menu.UploadSpeed.921600=921600
riotlite.menu.UploadSpeed.921600.upload.speed=921600
riotlite.menu.UploadSpeed.115200=115200
riotlite.menu.UploadSpeed.115200.upload.speed=115200
riotlite.menu.UploadSpeed.256000.windows=256000
riotlite.menu.UploadSpeed.256000.upload.speed=256000
riotlite.menu.UploadSpeed.230400.windows.upload.speed=256000
riotlite.menu.UploadSpeed.230400=230400
riotlite.menu.UploadSpeed.230400.upload.speed=230400
riotlite.menu.UploadSpeed.460800.linux=460800
riotlite.menu.UploadSpeed.460800.macosx=460800
riotlite.menu.UploadSpeed.460800.upload.speed=460800
riotlite.menu.UploadSpeed.512000.windows=512000
riotlite.menu.UploadSpeed.512000.upload.speed=512000

riotlite.menu.DebugLevel.none=None
riotlite.menu.DebugLevel.none.build.code_debug=0
riotlite.menu.DebugLevel.error=Error
riotlite.menu.DebugLevel.error.build.code_debug=1
riotlite.menu.DebugLevel.warn=Warn
riotlite.menu.DebugLevel.warn.build.code_debug=2
riotlite.menu.DebugLevel.info=Info
riotlite.menu.DebugLevel.info.build.code_debug=3
riotlite.menu.DebugLevel.debug=Debug
riotlite.menu.DebugLevel.debug.build.code_debug=4
riotlite.menu.DebugLevel.verbose=Verbose
riotlite.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

esp32c3.name=ESP32-C3 Dev Board
esp32c3.vid.0=0x303a
esp32c3.pid.0=0x1001

esp32c3.bootloader.tool=esptool_py
esp32c3.bootloader.tool.default=esptool_py

esp32c3.upload.tool=esptool_py
esp32c3.upload.tool.default=esptool_py
esp32c3.upload.tool.network=esp_ota

esp32c3.upload.maximum_size=4128768
esp32c3.upload.maximum_data_size=327680
esp32c3.upload.flags=
esp32c3.upload.extra_flags=
esp32c3.upload.use_1200bps_touch=false
esp32c3.upload.wait_for_upload_port=false

esp32c3.serial.disableDTR=false
esp32c3.serial.disableRTS=false

esp32c3.build.tarch=riscv32
esp32c3.build.target=esp
esp32c3.build.mcu=esp32c3
esp32c3.build.core=esp32
esp32c3.build.variant=esp32c3
esp32c3.build.board=ESP32C3_DEV
esp32c3.build.bootloader_addr=0x0

esp32c3.build.cdc_on_boot=1
esp32c3.build.f_cpu=160000000L
esp32c3.build.flash_size=4MB
esp32c3.build.flash_freq=80m
esp32c3.build.flash_mode=qio
esp32c3.build.boot=qio
esp32c3.build.partitions=default
esp32c3.build.defines=

esp32c3.menu.CDCOnBoot.default=Enabled
esp32c3.menu.CDCOnBoot.default.build.cdc_on_boot=1
esp32c3.menu.CDCOnBoot.cdcoff=Disabled
esp32c3.menu.CDCOnBoot.cdcoff.build.cdc_on_boot=0

esp32c3.menu.PartitionScheme.default=PYGMY (3MB APP/0.9MB SPIFFS)
esp32c3.menu.PartitionScheme.default.build.partitions=pygmy
esp32c3.menu.PartitionScheme.riotlite=rIOT-LITE (3.9MB APP)
esp32c3.menu.PartitionScheme.riotlite.build.partitions=riot_lite
esp32c3.menu.PartitionScheme.defaultspiffs=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32c3.menu.PartitionScheme.defaultspiffs.build.partitions=default
esp32c3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32c3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32c3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32c3.menu.PartitionScheme.minimal.build.partitions=minimal
esp32c3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32c3.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32c3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32c3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32c3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32c3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32c3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32c3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32c3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32c3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32c3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32c3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32c3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32c3.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32c3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32c3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32c3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32c3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32c3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32c3.menu.PartitionScheme.rainmaker=RainMaker
esp32c3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32c3.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

esp32c3.menu.CPUFreq.160=160MHz (WiFi)
esp32c3.menu.CPUFreq.160.build.f_cpu=160000000L
esp32c3.menu.CPUFreq.80=80MHz (WiFi)
esp32c3.menu.CPUFreq.80.build.f_cpu=80000000L
esp32c3.menu.CPUFreq.40=40MHz
esp32c3.menu.CPUFreq.40.build.f_cpu=40000000L
esp32c3.menu.CPUFreq.20=20MHz
esp32c3.menu.CPUFreq.20.build.f_cpu=20000000L
esp32c3.menu.CPUFreq.10=10MHz
esp32c3.menu.CPUFreq.10.build.f_cpu=10000000L

esp32c3.menu.FlashMode.qio=QIO
esp32c3.menu.FlashMode.qio.build.flash_mode=dio
esp32c3.menu.FlashMode.qio.build.boot=qio
esp32c3.menu.FlashMode.dio=DIO
esp32c3.menu.FlashMode.dio.build.flash_mode=dio
esp32c3.menu.FlashMode.dio.build.boot=dio
esp32c3.menu.FlashMode.qout=QOUT
esp32c3.menu.FlashMode.qout.build.flash_mode=dout
esp32c3.menu.FlashMode.qout.build.boot=qout
esp32c3.menu.FlashMode.dout=DOUT
esp32c3.menu.FlashMode.dout.build.flash_mode=dout
esp32c3.menu.FlashMode.dout.build.boot=dout

esp32c3.menu.FlashFreq.80=80MHz
esp32c3.menu.FlashFreq.80.build.flash_freq=80m
esp32c3.menu.FlashFreq.40=40MHz
esp32c3.menu.FlashFreq.40.build.flash_freq=40m

esp32c3.menu.FlashSize.4M=4MB (32Mb)
esp32c3.menu.FlashSize.4M.build.flash_size=4MB
esp32c3.menu.FlashSize.8M=8MB (64Mb)
esp32c3.menu.FlashSize.8M.build.flash_size=8MB
esp32c3.menu.FlashSize.8M.build.partitions=default_8MB
esp32c3.menu.FlashSize.2M=2MB (16Mb)
esp32c3.menu.FlashSize.2M.build.flash_size=2MB
esp32c3.menu.FlashSize.2M.build.partitions=minimal
esp32c3.menu.FlashSize.16M=16MB (128Mb)
esp32c3.menu.FlashSize.16M.build.flash_size=16MB

esp32c3.menu.UploadSpeed.921600=921600
esp32c3.menu.UploadSpeed.921600.upload.speed=921600
esp32c3.menu.UploadSpeed.115200=115200
esp32c3.menu.UploadSpeed.115200.upload.speed=115200
esp32c3.menu.UploadSpeed.256000.windows=256000
esp32c3.menu.UploadSpeed.256000.upload.speed=256000
esp32c3.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32c3.menu.UploadSpeed.230400=230400
esp32c3.menu.UploadSpeed.230400.upload.speed=230400
esp32c3.menu.UploadSpeed.460800.linux=460800
esp32c3.menu.UploadSpeed.460800.macosx=460800
esp32c3.menu.UploadSpeed.460800.upload.speed=460800
esp32c3.menu.UploadSpeed.512000.windows=512000
esp32c3.menu.UploadSpeed.512000.upload.speed=512000

esp32c3.menu.DebugLevel.none=None
esp32c3.menu.DebugLevel.none.build.code_debug=0
esp32c3.menu.DebugLevel.error=Error
esp32c3.menu.DebugLevel.error.build.code_debug=1
esp32c3.menu.DebugLevel.warn=Warn
esp32c3.menu.DebugLevel.warn.build.code_debug=2
esp32c3.menu.DebugLevel.info=Info
esp32c3.menu.DebugLevel.info.build.code_debug=3
esp32c3.menu.DebugLevel.debug=Debug
esp32c3.menu.DebugLevel.debug.build.code_debug=4
esp32c3.menu.DebugLevel.verbose=Verbose
esp32c3.menu.DebugLevel.verbose.build.code_debug=5

##############################################################